### [실습과제 13]

#### 1.

In [6]:
import numpy as np

r = [2, 4, 7, 10]
for i in r:
    a = np.pi*(i**2)
    print(a)

12.566370614359172
50.26548245743669
153.93804002589985
314.1592653589793

#### 2.

In [31]:
x = [1,2,3,4,5,6,7,8,9,10]

In [32]:
#a
print(len(x))

10

In [33]:
#b
print(np.sum(x))

55

In [34]:
#c
print(np.mean(x))

5.5

In [35]:
#d
print(np.var(x, ddof=1), np.std(x, ddof=1))

9.166666666666666 3.0276503540974917

In [36]:
#e
x1 = x[0::2]
print(x1)

[1, 3, 5, 7, 9]

#### 3.

In [22]:
import pandas as pd

#a
kor_score = pd.DataFrame({
    'name':['Kim', 'Lee','Park','Oh','Yang','Min','Jung','Moon'],
    'Korean':[93,76,87,92,98,75,82,92]
})
eng_score = pd.DataFrame({
    'name':['Kim', 'Lee','Park','Oh','Yang','Min','Jung','Moon'],
    'English':[90,94,88,75,79,87,88,90]
})

In [27]:
#b
kor_sort=kor_score.sort_values(by='name')
kor_sort

   name  Korean
6  Jung      82
0   Kim      93
1   Lee      76
5   Min      75
7  Moon      92
3    Oh      92
2  Park      87
4  Yang      98

In [28]:
eng_sort=eng_score.sort_values(by='name')
eng_sort

   name  English
6  Jung       88
0   Kim       90
1   Lee       94
5   Min       87
7  Moon       90
3    Oh       75
2  Park       88
4  Yang       79

In [29]:
#c
mer=pd.merge(kor_score, eng_score, left_on=['name'], right_on=['name'])
mer

   name  Korean  English
0   Kim      93       90
1   Lee      76       94
2  Park      87       88
3    Oh      92       75
4  Yang      98       79
5   Min      75       87
6  Jung      82       88
7  Moon      92       90